# Image format providing lossless and lossy compression for web images
brew "webp"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Command-line interface for SQLite
brew "sqlite"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Diff that understands syntax
brew "difftastic"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Post-modern modal text editor
brew "helix"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
## Powerful, lightweight programming language
# brew "lua"
## Just-In-Time Compiler (JIT) for the Lua programming language
# brew "luajit"
##Parser generator tool and incremental parsing library
# brew "tree-sitter"
##Ambitious Vim-fork focused on extensibility and agility
# brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Modern shell for the GitHub era
brew "nushell"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Pyright fork with various improvements and built-in pylance features
brew "basedpyright"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Cross-shell prompt for astronauts
brew "starship"
# Command-line unarchiving tools supporting multiple formats
# brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Autoformat shell script source code
brew "shfmt"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Language Server for Yaml Files
brew "yaml-language-server"
# TOML toolkit written in Rust
brew "taplo"
# Language Server for the Lua language
brew "lua-language-server"
# Handy way to save and run project-specific commands
brew "just"

## Enable Windows-like alt-tab
#cask "alt-tab"
## Automatic tiling window manager similar to xmonad
#cask "amethyst"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Trains AIs to understand and translate texts
cask "deepl"
# Web browser focusing on privacy
cask "duckduckgo"
# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
# GIT client
cask "fork"
# Free and open-source image editor
cask "gimp"
# Menu bar manager
cask "jordanbaird-ice"
# Open source API development ecosystem
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
## Terminal emulator as alternative to Apple's Terminal app
#cask "iterm2"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Text translation application
cask "reverso"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# System monitor for the menu bar
cask "stats"
## Binary releases of VS Code without MS branding/telemetry/licensing
#cask "vscodium"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Multiplayer code editor
cask "zed"
# Microsoft Visual Studio Code
cask "visual-studio-code"
